Revit 2027 API
BuiltInFailures.GridChainSketchFailures.OverlappingLines Property
 GridChain sketch contains lines which overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OverlappingLines { get; }
Public Shared ReadOnly Property OverlappingLines As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OverlappingLines {
	FailureDefinitionId^ get ();
}
static member OverlappingLines : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GridChainSketchFailures Class
Autodesk.Revit.DB Namespace